XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-V_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>SAM-V_DFP</name>
  <description>Microchip SAMV7 Series Device Support</description>
  
  <releases>
     <release version="2.4.2" date="2019-06-07" deprecated="2019-06-07" replacement="Atmel.SAMV70_DFP">
       This pack is no longer maintained by Arm. Microchip maintains the Atmel.SAMV70_DFP and Atmel.SAMV71_DFP packs going forward.
     </release>
    <release version="2.4.1" date="2018-05-07">
      Updated device vendor from Atmel to Microchip.
      Updated PLL frequency to avoid exceeding the maximum value defined in the datasheet
      Updated system file with corrected SystemCoreClock initial value to value set by SystemInit function
    </release>
    <release version="2.4.0" date="2017-10-02">
      Added support for revision B devices.
    </release>
    <release version="2.3.1" date="2016-11-21">
      Fixed SPI and QSPI RDR registers in SVD files.
    </release>
    <release version="2.3.0" date="2016-04-14">
      Added debug description for automated trace configuration setup.
    </release>
    <release version="2.2.0" date="2015-10-09">
      Requires Keil.SAM-ESV7_SFP Version 2.2.0 (now providing the HAL and CMSIS Driver for the devices)
      Updated pack with content from Atmel's SAMV70_DFP Version 1.0.25 and SAMV71_DFP Version 1.0.19.
      - updated device hierarchy family and subfamily names and directory structure
      CMSIS-Driver Updates:
      - all drivers have been moved into Keil.SAM-ESV7_SFP Pack
      Moved Middleware examples to Keil.SAM-ESV7_SFP Pack
    </release>
    <release version="2.0.0" date="2015-07-22">
      Added CMSIS-Driver:
      - Ethernet, USART, I2C, USB Device, MCI, Ethernet, SPI
      Updated board features, added Middleware examples and documentation.
      Integrated the Chip Library from the SAMV71 Xplained Ultra Software Package Version 1.3
    </release>
    <release version="1.0.0" date="2015-01-28">
      Initial Version of SAM V Device Family Pack.
    </release>
  </releases>
  
  <keywords>
    <keyword>Microchip</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Microchip</keyword>
    <keyword>SAMV70</keyword>
    <keyword>SAMV71</keyword>
  </keywords>
  
  <devices>
    <family Dfamily="SAMV70" Dvendor="Microchip:3">
      <debugvars configfile="samv70/keil/debug/SAMx7.dbgconf" version="1.0.0">
        // Debug Access Variables
        __var TracePCK3 = 0x00000000;                                               // Trace Clock Source Selection and Prescaler
      </debugvars>
     
      <sequences>
        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
          </block>
          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>
          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>
        </sequence>
     
        <!-- User-Defined EnableTraceSWO Sequence -->
        <sequence name="EnableTraceSWO">
          <block>
            Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
            Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
            Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
          </block>
        </sequence>
     
        <!-- User-Defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var width = (__traceout &amp; 0x003F0000) &gt;&gt; 16;                // TPIU Port Width
            __var val   = 0;
          </block>
          <control if="width == 1">
            <block>
              // 1-Bit TPIU Trace Setup
              val = 0x00000010;                                                     // TRACED[0]
            </block>
          </control>
          <control if="width == 2">
            <block>
              // 2-Bit TPIU Trace Setup
              val = 0x00000030;                                                     // TRACED[0..1]
            </block>
          </control>
          <control if="width == 4">
            <block>
              // 4-Bit TPIU Trace Setup
              val = 0x000000F0;                                                     // TRACED[0..3]
            </block>
          </control>
          <block>
            // Write Trace Configuration to Target
            Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
            Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
            Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
            Write32(0x400E0610, (1 &lt;&lt; 16));                                   // Enable PIOD clock
     
            Write32(0x400E14E4, 0x50494F00);                                        // Disable PIOD write protection
            Write32(0x400E1404, (val | 0x00000100));                                // Disable PIOD PD[4..8]
            Write32(0x400E1470, ((Read32(0x400E1470) &amp; ~val) | 0x00000100));    // Set Peripheral Select registers
            Write32(0x400E1474, ((Read32(0x400E1474) |      val) | 0x00000100));    // TRACED[0..3] to alternate peripheral C and TRACECLK to alternate peripheral D
          </block>
        </sequence>
     
