XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-V_DFP.pdsc
        <sequences>
          <!-- Override for Pre-Defined TraceStart Sequence -->
          <sequence name="TraceStart">
            <block>
              __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
              __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
            </block>
            <control if="traceSWO">
              <block>
                Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
              </block>
            </control>
            <control if="traceTPIU">
              <block>
                Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
              </block>
            </control>
          </sequence>
     
          <!-- User-Defined EnableTraceSWO Sequence -->
          <sequence name="EnableTraceSWO">
            <block>
              Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
              Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
              Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
            </block>
          </sequence>
     
          <!-- User-Defined EnableTraceTPIU Sequence -->
          <sequence name="EnableTraceTPIU">
            <block>
              __var width = (__traceout &amp; 0x003F0000) &gt;&gt; 16;                // TPIU Port Width
              __var val   = 0;
            </block>
            <control if="width == 1">
              <block>
                // 1-Bit TPIU Trace Setup
                val = 0x00000010;                                                     // TRACED[0]
              </block>
            </control>
            <control if="width == 2">
              <block>
                // 2-Bit TPIU Trace Setup
                val = 0x00000030;                                                     // TRACED[0..1]
              </block>
            </control>
            <control if="width == 4">
              <block>
                // 4-Bit TPIU Trace Setup
                val = 0x000000F0;                                                     // TRACED[0..3]
              </block>
            </control>
            <block>
              // Write Trace Configuration to Target
              Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
              Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
              Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
              Write32(0x400E0610, (1 &lt;&lt; 16));                                   // Enable PIOD clock
     
              Write32(0x400E14E4, 0x50494F00);                                        // Disable PIOD write protection
              Write32(0x400E1404, (val | 0x00000100));                                // Disable PIOD PD[4..8]
              Write32(0x400E1470, ((Read32(0x400E1470) &amp; ~val) | 0x00000100));    // Set Peripheral Select registers
              Write32(0x400E1474, ((Read32(0x400E1474) |      val) | 0x00000100));    // TRACED[0..3] to alternate peripheral C and TRACECLK to alternate peripheral D
            </block>
          </sequence>     
        </sequences>

        <device Dname="ATSAMV71J21">
        <processor Dcore="Cortex-M7"
                    Dendian="Little-endian"
                    Dmpu="MPU"
                    Dfpu="DP_FPU"/>
        <compile header="samv71/include/sam.h" define="__SAMV71J21__"/>
        <debug svd="samv71/svd/ATSAMV71J21.svd"/>
        <memory id="IROM1"
                start="0x00400000"
                size="0x00200000"
                default="1"
                startup="1"/>
        <memory id="IROM2" start="0x00800000" size="0x00004000"/>
        <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
        <algorithm name="samv71/keil/flash/ATSAMV7x_2048.FLM"
                    start="0x00400000"
                    size="0x00200000"
                    default="1"/>
        <algorithm name="samv71/keil/flash/ATSAMV7x_GPNVM.FLM"
                    start="0x1FFFFFF0"
                    size="0x00000010"
                    default="0"/>
        <environment name="atmel">
          <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                        schemaVersion="1.0">
            <at:atdf name="samv71/atdf/ATSAMV71J21.atdf"/>
            <at:variant ordercode="ATSAMV71J21A-AAB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:memory name="PERIPHERALS"
                        start="0x40000000"
                        size="0x20000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="SYSTEM"
                        start="0xE0000000"
                        size="0x10000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="QSPIMEM"
                        start="0x80000000"
                        size="0x20000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="AXIMX"
                        start="0xA0000000"
                        size="0x00100000"
                        type="other"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="ITCM"
                        start="0x00000000"
                        size="0x00200000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IFLASH"
                        start="0x00400000"
                        size="0x00200000"
                        type="flash"
                        pagesize="512"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IROM"
                        start="0x00800000"
                        size="0x00004000"
                        type="rom"
                        exec="true"
                        address-space="base"/>
            <at:memory name="DTCM"
                        start="0x20000000"
                        size="0x00020000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IRAM"
                        start="0x20400000"
                        size="0x00060000"
                        type="ram"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS0"
                        start="0x60000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS1"
                        start="0x61000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS2"
                        start="0x62000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS3"
                        start="0x63000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="SDRAM_CS"
                        start="0x70000000"
                        size="0x10000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:interface type="samjtag" name="JTAG"/>
            <at:interface type="swd" name="SWD"/>
            <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
            <at:tool id="com.atmel.avrdbg.tool.medbg"/>
            <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
            <at:tool id="com.atmel.avrdbg.tool.samice"/>
            <at:project name="Barebone C Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.c)"/>
              </at:component>
            </at:project>
            <at:project name="Barebone Cpp Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.cpp)"/>
              </at:component>
            </at:project>
            <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
            <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
            <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
          </at:extension>
        </environment>
        <description>ARM® Cortex®-M7 microcontroller with 2MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, CAN-FD, Full-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins</description>
        <book name="http://www.atmel.com/images/Atmel-44003-32-bit-Cortex-M7-Microcontroller-SAM-V71Q-SAM-V71N-SAM-V71J_Datasheet.pdf"
              title="Datasheet"/>
        <book name="http://www.atmel.com/devices/ATSAMV71J21.aspx"
              title="Device Page"/>
      </device>
      <device Dname="ATSAMV71J20">
        <processor Dcore="Cortex-M7"
                    Dendian="Little-endian"
                    Dmpu="MPU"
                    Dfpu="DP_FPU"/>
        <compile header="samv71/include/sam.h" define="__SAMV71J20__"/>
        <debug svd="samv71/svd/ATSAMV71J20.svd"/>
        <memory id="IROM1"
                start="0x00400000"
                size="0x00100000"
                default="1"
                startup="1"/>
        <memory id="IROM2" start="0x00800000" size="0x00004000"/>
        <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
        <algorithm name="samv71/keil/flash/ATSAMV7x_1024.FLM"
                    start="0x00400000"
                    size="0x00100000"
                    default="1"/>
        <algorithm name="samv71/keil/flash/ATSAMV7x_GPNVM.FLM"
                    start="0x1FFFFFF0"
                    size="0x00000010"
                    default="0"/>
        <environment name="atmel">
          <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                        schemaVersion="1.0">
            <at:atdf name="samv71/atdf/ATSAMV71J20.atdf"/>
            <at:variant ordercode="ATSAMV71J20A-AAB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:memory name="PERIPHERALS"
                        start="0x40000000"
                        size="0x20000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="SYSTEM"
                        start="0xE0000000"
                        size="0x10000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="QSPIMEM"
                        start="0x80000000"
                        size="0x20000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="AXIMX"
                        start="0xA0000000"
                        size="0x00100000"
                        type="other"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="ITCM"
                        start="0x00000000"
                        size="0x00200000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IFLASH"
                        start="0x00400000"
                        size="0x00100000"
                        type="flash"
                        pagesize="512"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IROM"
                        start="0x00800000"
                        size="0x00004000"
                        type="rom"
                        exec="true"
                        address-space="base"/>
            <at:memory name="DTCM"
                        start="0x20000000"
                        size="0x00020000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IRAM"
                        start="0x20400000"
                        size="0x00060000"
                        type="ram"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS0"
                        start="0x60000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS1"
                        start="0x61000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS2"
                        start="0x62000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS3"
                        start="0x63000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="SDRAM_CS"
                        start="0x70000000"
                        size="0x10000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:interface type="samjtag" name="JTAG"/>
            <at:interface type="swd" name="SWD"/>
            <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
            <at:tool id="com.atmel.avrdbg.tool.medbg"/>
            <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
            <at:tool id="com.atmel.avrdbg.tool.samice"/>
            <at:project name="Barebone C Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.c)"/>
              </at:component>
            </at:project>
            <at:project name="Barebone Cpp Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.cpp)"/>
              </at:component>
            </at:project>
            <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
            <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
            <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
          </at:extension>
        </environment>
        <description>ARM® Cortex®-M7 microcontroller with 1MB Flash, 384kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, CAN-FD, Full-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins</description>
        <book name="http://www.atmel.com/images/Atmel-44003-32-bit-Cortex-M7-Microcontroller-SAM-V71Q-SAM-V71N-SAM-V71J_Datasheet.pdf"
              title="Datasheet"/>
        <book name="http://www.atmel.com/devices/ATSAMV71J20.aspx"
              title="Device Page"/>
      </device>
