XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-V_DFP.pdsc
      <device Dname="ATSAMV71Q19">
        <processor Dcore="Cortex-M7"
                    Dendian="Little-endian"
                    Dmpu="MPU"
                    Dfpu="DP_FPU"/>
        <compile header="samv71/include/sam.h" define="__SAMV71Q19__"/>
        <debug svd="samv71/svd/ATSAMV71Q19.svd"/>
        <memory id="IROM1"
                start="0x00400000"
                size="0x00080000"
                default="1"
                startup="1"/>
        <memory id="IROM2" start="0x00800000" size="0x00004000"/>
        <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
        <algorithm name="samv71/keil/flash/ATSAMV7x_512.FLM"
                    start="0x00400000"
                    size="0x00080000"
                    default="1"/>
        <algorithm name="samv71/keil/flash/ATSAMV7x_GPNVM.FLM"
                    start="0x1FFFFFF0"
                    size="0x00000010"
                    default="0"/>
        <environment name="atmel">
          <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                        schemaVersion="1.0">
            <at:atdf name="samv71/atdf/ATSAMV71Q19.atdf"/>
            <at:variant ordercode="ATSAMV71Q19A-CB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:variant ordercode="ATSAMV71Q19A-AAB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:memory name="PERIPHERALS"
                        start="0x40000000"
                        size="0x20000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="SYSTEM"
                        start="0xE0000000"
                        size="0x10000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="QSPIMEM"
                        start="0x80000000"
                        size="0x20000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="AXIMX"
                        start="0xA0000000"
                        size="0x00100000"
                        type="other"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="ITCM"
                        start="0x00000000"
                        size="0x00200000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IFLASH"
                        start="0x00400000"
                        size="0x00080000"
                        type="flash"
                        pagesize="512"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IROM"
                        start="0x00800000"
                        size="0x00004000"
                        type="rom"
                        exec="true"
                        address-space="base"/>
            <at:memory name="DTCM"
                        start="0x20000000"
                        size="0x00020000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IRAM"
                        start="0x20400000"
                        size="0x00040000"
                        type="ram"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS0"
                        start="0x60000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS1"
                        start="0x61000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS2"
                        start="0x62000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS3"
                        start="0x63000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="SDRAM_CS"
                        start="0x70000000"
                        size="0x10000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:interface type="samjtag" name="JTAG"/>
            <at:interface type="swd" name="SWD"/>
            <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
            <at:tool id="com.atmel.avrdbg.tool.medbg"/>
            <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
            <at:tool id="com.atmel.avrdbg.tool.samice"/>
            <at:project name="Barebone C Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.c)"/>
              </at:component>
            </at:project>
            <at:project name="Barebone Cpp Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.cpp)"/>
              </at:component>
            </at:project>
            <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
            <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
            <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
          </at:extension>
        </environment>
        <description>ARM® Cortex®-M7 microcontroller with 512KB Flash, 256kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, dual CAN-FD, SD/MMC, High-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 3 USARTs/SPI, 2 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, External Bus Interface, SDRAM Controller, 144 pins</description>
        <book name="http://www.atmel.com/images/Atmel-44003-32-bit-Cortex-M7-Microcontroller-SAM-V71Q-SAM-V71N-SAM-V71J_Datasheet.pdf"
              title="Datasheet"/>
        <book name="http://www.atmel.com/devices/ATSAMV71Q19.aspx"
              title="Device Page"/>
      </device>
      <device Dname="ATSAMV71N19B">
        <processor Dcore="Cortex-M7"
                    Dendian="Little-endian"
                    Dmpu="MPU"
                    Dfpu="DP_FPU"/>
        <compile header="samv71b/include/sam.h" define="__SAMV71N19B__"/>
        <debug svd="samv71b/svd/ATSAMV71N19B.svd"/>
        <memory id="IROM1"
                start="0x00400000"
                size="0x00080000"
                default="1"
                startup="1"/>
        <memory id="IROM2" start="0x00800000" size="0x00004000"/>
        <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
        <algorithm name="samv71b/keil/flash/ATSAMV7x_512.FLM"
            start="0x00400000"
            size="0x00080000"
            default="1"/>
        <algorithm name="samv71b/keil/flash/ATSAMV7x_GPNVM.FLM"
                    start="0x1FFFFFF0"
                    size="0x00000010"
                    default="0"/>
        <environment name="atmel">
          <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                        schemaVersion="1.0">
            <at:atdf name="samv71b/atdf/ATSAMV71N19B.atdf"/>
            <at:variant ordercode="ATSAMV71N19B-CB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:variant ordercode="ATSAMV71N19B-AAB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:memory name="PERIPHERALS"
                        start="0x40000000"
                        size="0x20000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="SYSTEM"
                        start="0xE0000000"
                        size="0x10000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="QSPIMEM"
                        start="0x80000000"
                        size="0x20000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="AXIMX"
                        start="0xA0000000"
                        size="0x00100000"
                        type="other"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="ITCM"
                        start="0x00000000"
                        size="0x00200000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IFLASH"
                        start="0x00400000"
                        size="0x00080000"
                        type="flash"
                        pagesize="512"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IROM"
                        start="0x00800000"
                        size="0x00004000"
                        type="rom"
                        exec="true"
                        address-space="base"/>
            <at:memory name="DTCM"
                        start="0x20000000"
                        size="0x00020000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IRAM"
                        start="0x20400000"
                        size="0x00040000"
                        type="ram"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS0"
                        start="0x60000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS1"
                        start="0x61000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS2"
                        start="0x62000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS3"
                        start="0x63000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="SDRAM_CS"
                        start="0x70000000"
                        size="0x10000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:interface type="samjtag" name="JTAG"/>
            <at:interface type="swd" name="SWD"/>
            <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
            <at:tool id="com.atmel.avrdbg.tool.medbg"/>
            <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
            <at:tool id="com.atmel.avrdbg.tool.samice"/>
            <at:project name="Barebone C Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.c)"/>
              </at:component>
            </at:project>
            <at:project name="Barebone Cpp Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.cpp)"/>
              </at:component>
            </at:project>
            <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
            <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
          </at:extension>
        </environment>
        <description>ARM® Cortex®-M7 microcontroller with 512KB Flash, 256kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, dual CAN-FD, SD/MMC, High-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 3 USARTs/SPI, 2 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, External Bus Interface, 100 pins</description>
        <book name="http://www.atmel.com/images/Atmel-44003-32-bit-Cortex-M7-Microcontroller-SAM-V71Q-SAM-V71N-SAM-V71J_Datasheet.pdf"
              title="Datasheet"/>
        <book name="http://www.atmel.com/devices/ATSAMV71N19.aspx"
              title="Device Page"/>
      </device>
      <device Dname="ATSAMV71Q19B">
        <processor Dcore="Cortex-M7"
                    Dendian="Little-endian"
                    Dmpu="MPU"
                    Dfpu="DP_FPU"/>
        <compile header="samv71b/include/sam.h" define="__SAMV71Q19B__"/>
        <debug svd="samv71b/svd/ATSAMV71Q19B.svd"/>
        <memory id="IROM1"
                start="0x00400000"
                size="0x00080000"
                default="1"
                startup="1"/>
        <memory id="IROM2" start="0x00800000" size="0x00004000"/>
        <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
        <algorithm name="samv71b/keil/flash/ATSAMV7x_512.FLM"
            start="0x00400000"
            size="0x00080000"
            default="1"/>
        <algorithm name="samv71b/keil/flash/ATSAMV7x_GPNVM.FLM"
                    start="0x1FFFFFF0"
                    size="0x00000010"
                    default="0"/>
        <environment name="atmel">
          <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                        schemaVersion="1.0">
            <at:atdf name="samv71b/atdf/ATSAMV71Q19B.atdf"/>
            <at:variant ordercode="ATSAMV71Q19B-CB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:variant ordercode="ATSAMV71Q19B-AAB"
                        vccmin="1.62"
                        vccmax="3.6"
                        tempmin="-40"
                        tempmax="+105"/>
            <at:memory name="PERIPHERALS"
                        start="0x40000000"
                        size="0x20000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="SYSTEM"
                        start="0xE0000000"
                        size="0x10000000"
                        type="io"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="QSPIMEM"
                        start="0x80000000"
                        size="0x20000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="AXIMX"
                        start="0xA0000000"
                        size="0x00100000"
                        type="other"
                        rw="RW"
                        address-space="base"/>
            <at:memory name="ITCM"
                        start="0x00000000"
                        size="0x00200000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IFLASH"
                        start="0x00400000"
                        size="0x00080000"
                        type="flash"
                        pagesize="512"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IROM"
                        start="0x00800000"
                        size="0x00004000"
                        type="rom"
                        exec="true"
                        address-space="base"/>
            <at:memory name="DTCM"
                        start="0x20000000"
                        size="0x00020000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="IRAM"
                        start="0x20400000"
                        size="0x00040000"
                        type="ram"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS0"
                        start="0x60000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS1"
                        start="0x61000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS2"
                        start="0x62000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="EBI_CS3"
                        start="0x63000000"
                        size="0x01000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:memory name="SDRAM_CS"
                        start="0x70000000"
                        size="0x10000000"
                        type="other"
                        rw="RW"
                        exec="true"
                        address-space="base"/>
            <at:interface type="samjtag" name="JTAG"/>
            <at:interface type="swd" name="SWD"/>
            <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
            <at:tool id="com.atmel.avrdbg.tool.edbg"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
            <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
            <at:tool id="com.atmel.avrdbg.tool.medbg"/>
            <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
            <at:tool id="com.atmel.avrdbg.tool.samice"/>
            <at:project name="Barebone C Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.c)"/>
              </at:component>
            </at:project>
            <at:project name="Barebone Cpp Project">
              <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
              <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                <at:template select="Main file (.cpp)"/>
              </at:component>
            </at:project>
            <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
            <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
          </at:extension>
        </environment>
        <description>ARM® Cortex®-M7 microcontroller with 512KB Flash, 256kB multi-port SRAM with Configurable Tightly Coupled Memory, QSPI, 10/100Mbps Ethernet MAC with AVB support, MediaLB 3-wire, dual CAN-FD, SD/MMC, High-speed USB host and device with integrated PHY, Serial Synchronous Controller for I2S/TDM, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 3 USARTs/SPI, 2 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, External Bus Interface, SDRAM Controller, 144 pins</description>
        <book name="http://www.atmel.com/images/Atmel-44003-32-bit-Cortex-M7-Microcontroller-SAM-V71Q-SAM-V71N-SAM-V71J_Datasheet.pdf"
              title="Datasheet"/>
        <book name="http://www.atmel.com/devices/ATSAMV71Q19.aspx"
              title="Device Page"/>
      </device>
