XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-V_DFP.pdsc
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71N21">
      <description>Headers and startup code for Microchip ATSAMV71N21</description>
      <files>
        <file condition="C" category="include" name="samv71/include/"/>
        <file condition="C" category="header" name="samv71/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71/gcc/gcc/startup_samv71n21.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71/gcc/system_samv71n21.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71/gcc/gcc/samv71n21_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71/gcc/gcc/samv71n21_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71/iar/iar/startup_samv71n21.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71/iar/system_samv71n21.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71/iar/iar/samv71n21_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71/iar/iar/samv71n21_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71N20">
      <description>Headers and startup code for Microchip ATSAMV71N20</description>
      <files>
        <file condition="C" category="include" name="samv71/include/"/>
        <file condition="C" category="header" name="samv71/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71/gcc/gcc/startup_samv71n20.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71/gcc/system_samv71n20.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71/gcc/gcc/samv71n20_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71/gcc/gcc/samv71n20_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71/iar/iar/startup_samv71n20.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71/iar/system_samv71n20.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71/iar/iar/samv71n20_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71/iar/iar/samv71n20_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71J21B">
      <description>Headers and startup code for Microchip ATSAMV71J21B</description>
      <files>
        <file condition="C" category="include" name="samv71b/include/"/>
        <file condition="C" category="header" name="samv71b/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/gcc/startup_samv71j21b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/system_samv71j21b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71b/gcc/gcc/samv71j21b_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71b/gcc/gcc/samv71j21b_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/iar/startup_samv71j21b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/system_samv71j21b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71b/iar/iar/samv71j21b_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71b/iar/iar/samv71j21b_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71J20B">
      <description>Headers and startup code for Microchip ATSAMV71J20B</description>
      <files>
        <file condition="C" category="include" name="samv71b/include/"/>
        <file condition="C" category="header" name="samv71b/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/gcc/startup_samv71j20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/system_samv71j20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71b/gcc/gcc/samv71j20b_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71b/gcc/gcc/samv71j20b_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/iar/startup_samv71j20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/system_samv71j20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71b/iar/iar/samv71j20b_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71b/iar/iar/samv71j20b_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71Q20B">
      <description>Headers and startup code for Microchip ATSAMV71Q20B</description>
      <files>
        <file condition="C" category="include" name="samv71b/include/"/>
        <file condition="C" category="header" name="samv71b/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/gcc/startup_samv71q20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/system_samv71q20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71b/gcc/gcc/samv71q20b_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71b/gcc/gcc/samv71q20b_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/iar/startup_samv71q20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/system_samv71q20b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71b/iar/iar/samv71q20b_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71b/iar/iar/samv71q20b_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71Q19">
      <description>Headers and startup code for Microchip ATSAMV71Q19</description>
      <files>
        <file condition="C" category="include" name="samv71/include/"/>
        <file condition="C" category="header" name="samv71/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71/gcc/gcc/startup_samv71q19.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71/gcc/system_samv71q19.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71/gcc/gcc/samv71q19_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71/gcc/gcc/samv71q19_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71/iar/iar/startup_samv71q19.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71/iar/system_samv71q19.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71/iar/iar/samv71q19_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71/iar/iar/samv71q19_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
    <component Cvendor="Atmel"
                Cclass="Device"
                Cgroup="Startup"
                Cversion="2.2.0"
                condition="ATSAMV71N19B">
      <description>Headers and startup code for Microchip ATSAMV71N19B</description>
      <files>
        <file condition="C" category="include" name="samv71b/include/"/>
        <file condition="C" category="header" name="samv71b/include/sam.h"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Exe"
              category="source"
              name="samv71b/templates/main.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.c"
              attr="template"
              select="Main file (.c)"/>
        <file condition="C Lib"
              category="source"
              name="samv71b/templates/library.cpp"
              attr="template"
              select="Main file (.cpp)"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/gcc/startup_samv71n19b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="source"
              name="samv71b/gcc/system_samv71n19b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="linkerScript"
              name="samv71b/gcc/gcc/samv71n19b_flash.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="GCC Exe"
              category="other"
              name="samv71b/gcc/gcc/samv71n19b_sram.ld"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/system_SAMV71.c"
              attr="config"
              version="1.0.0"/>
        <file condition="ARMCC Exe"
              category="source"
              name="samv71b/armcc/arm/startup_SAMV71.s"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/iar/startup_samv71n19b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="source"
              name="samv71b/iar/system_samv71n19b.c"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="linkerScript"
              name="samv71b/iar/iar/samv71n19b_flash.icf"
              attr="config"
              version="1.0.0"/>
        <file condition="IAR Exe"
              category="other"
              name="samv71b/iar/iar/samv71n19b_sram.icf"
              attr="config"
              version="1.0.0"/>
      </files>
    </component>
